In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/Users/jojomac/introduction_python/dataset/titanic/train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 1. Data Cleaning 

Data Cleaning merupakan proses untuk membersihkan data menjadi lebih mudah dimengerti menjadi lebih informatif, dan menghapus data data yang rusak atau data data yang tidak terlalu diperlukan dalam proses analysis. Data Cleaning dapat meliputi menghapus data null, mengganti data dan nilai tertentu, dll

In [4]:
# Mengecek berapa jumlah null value pada masing masing kolom. 
jumlah_missing = pd.isnull(df).sum()
jumlah_missing

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
# menghitung ratio missing value pada metrics cabin
rasio = jumlah_missing.div(len(df))
rasio

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [6]:
#hapus kolom cabin
# Kolom Cabin memiliki jumlah missing value hingga 77% sehingga kolom Kabin lebih baik dihilangkan (drop) dari table
df = df.drop(['Cabin'], axis=1)

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [9]:
# Statistik descriptif dari variabel age
df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [10]:
# menghitung ratio missing value pada metrics cabin
rasio = jumlah_missing.div(len(df))
rasio

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

### 1.1 Handling Kolom Numerikal

Setelah mengahapus kolom cabin nyatanya masih terdapat beberapa missing value pada dataset kita, ada beberapa hal yang bisa dilakukan, untuk data numerikal yaitu dengan menghapus datanull tersebut, atau melakukan inputation. Apabila nilai mean dengan median tidak terlalu jauh maka efektifnya adlaah dengan inputation, biasanya dengan mengganti dengan nilai rata rata kolom tersebut

In [11]:
# Mengubah NaNs dengan nilai Mean 
df['Age'].fillna(int(df['Age'].mean()), inplace=True)

In [12]:
# Cek kembali apakah masih terdapat missing value
pd.isnull(df).sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

### 1.2 Handling Kategorikal

Handling Kategorikal biasanya dilakukan dengan nilai modus / data yang paling sering langsung

In [18]:
df['Embarked'].mode()

0    S
Name: Embarked, dtype: object

In [21]:
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

In [22]:
# Cek kembali apakah masih terdapat missing value
pd.isnull(df).sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

### 1.3 Check Duplicate Value

In [23]:
# Mengidentifikasi apakah terdapat duplicate value pada tabel dengan acuan kolom PassengerId
df[df["PassengerId"].duplicated(keep=False)].sort_values("PassengerId")

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Embarked]
Index: []